In [6]:
import pandas as pd
import numpy as np

In [58]:
# Загрузка данных
data = pd.read_csv('titanic.csv',  index_col =  'PassengerId')

In [16]:
data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

1) Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.
2) Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.
3) Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.
4) Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.
5) Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.
6) Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name).

## 1 Вопрос

In [28]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [29]:
with open ('coursera - 1.txt','w') as ouf:
    ouf.write('314 577,')

## 2 Вопрос

In [34]:
data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [42]:
round((342/(549+342))*100, 2)

38.38

## 3 Вопрос

In [65]:
data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [66]:
round((216/(891))*100, 2)

24.24

## 4 Вопрос

In [75]:
data['Age'].median()

28.0

## 5 Вопрос

In [170]:
data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [172]:
df = data.drop(columns = ['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'Ticket',
       'Fare', 'Cabin', 'Embarked'])

In [178]:
round(df.corr('pearson'), 2)

       SibSp  Parch
SibSp   1.00   0.41
Parch   0.41   1.00

## 6 Вопрос

In [166]:
names = data['Name'].values

In [146]:
data[data['Sex'] == 'female']['Name'].value_counts()

William    13
Anna        9
Mary        9
John        6
Thomas      6
           ..
Gladys      1
Joan        1
Aloisia     1
Ellis       1
Peter       1
Name: Name, Length: 202, dtype: int64

# =========================================================================

# Важность признаков. Деревья решений

1) Загрузите выборку из файла titanic.csv с помощью пакета Pandas.
2) Оставьте в выборке четыре признака: класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).
3) Обратите внимание, что признак Sex имеет строковые значения.
4) Выделите целевую переменную — она записана в столбце Survived.
5) В данных есть пропущенные значения — например, для некоторых пассажиров неизвестен их возраст. Такие записи при чтении их в pandas принимают значение nan. Найдите все объекты, у которых есть пропущенные признаки, и удалите их из выборки.
6) Обучите решающее дерево с параметром random_state=241 и остальными параметрами по умолчанию (речь идет о параметрах конструктора DecisionTreeСlassifier).
7) Вычислите важности признаков и найдите два признака с наибольшей важностью. Их названия будут ответами для данной задачи (в качестве ответа укажите названия признаков через запятую или пробел, порядок не важен).

## 2)

In [66]:
# Удаляем признаки
X = data.drop(columns = ['Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'])

## 3)

In [67]:
X['Sex'] = X['Sex'].map({'male': 1, 'female' : 0})

In [68]:
X

             Survived  Pclass  Sex   Age     Fare
PassengerId
1                   0       3    1  22.0   7.2500
2                   1       1    0  38.0  71.2833
3                   1       3    0  26.0   7.9250
4                   1       1    0  35.0  53.1000
5                   0       3    1  35.0   8.0500
...               ...     ...  ...   ...      ...
887                 0       2    1  27.0  13.0000
888                 1       1    0  19.0  30.0000
889                 0       3    0   NaN  23.4500
890                 1       1    1  26.0  30.0000
891                 0       3    1  32.0   7.7500

[891 rows x 5 columns]

In [69]:
X['Sex'] = X['Sex'].astype('int32')

## 5)

In [70]:
np.isnan(X['Age']).value_counts()

False    714
True     177
Name: Age, dtype: int64

In [71]:
X = X.dropna()

## 4)

In [73]:
y = X['Survived']

In [76]:
X = X.drop(columns = 'Survived')

## 6)

In [78]:
# Инициализация дерева
from sklearn.tree import DecisionTreeClassifier
clf = DecisionTreeClassifier(random_state=241)

In [79]:
# Обучение дерева
clf.fit(X, y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=241, splitter='best')

## 7)

In [92]:
clf.feature_importances_

array([0.14000522, 0.30051221, 0.2560461 , 0.30343647])

In [90]:
X.columns

Index(['Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [94]:
with open ('coursera-1.txt','w') as ouf:
    ouf.write('Sex,Fare')